[
   {
      "name": "landing",
      "nested":
          [
             {
                "class": "intro",
                "text": "Sincerly,"
              },
             {
                "class": "motto",
                "text": "Yours truly!"
              }
           ]
    },
   {
      "name": "briefing",
      "nested":
          [
             {
                "class": "paragraph",
                "nested":
                    [
                       {
                          "class": "title",
                          "text": "Who am I?"
                        },
                       {
                          "class": "content",
                          "text": "You can think of as a mechanic. But instead of vehicles, I operate on programs and apps. In short, I fix and/or upgrade your website, app or program within my capabilities. That's the short version. Let me elaborate."
                        }
                     ]
              },
              {
                 "class": "paragraph",
                 "nested":
                    [
                       {
                          "class": "title",
                          "text": "Development"
                        },
                       {
                          "class": "content",
                          "text": "I'm part of that coding world where we do this wierd thing called RESTful development. It's just a fancy word that means we don't mess our codes together. Each part of the system is  developed separately. It makes development, troubleshooting and upgrade much easier. Using that method, we can also easily combine multiple languages together to make up a program or system. The downside though is that it's not a one file program. So if coded poorly, losing one file could cause a disaster or even crash the whole system. (Although, that's true with just about any program/system.)"
                        },
                       {
                          "class": "content",
                          "text": "That's also one of the areas where yours truly comes in handy. I usually tend to those possibilities. It would still cripple the system in some kind of way though. Since that one file could contain a whole feature or a critical part of it. Anyway, that's a big if that rarely happens."
                        }
                     ]
              },
             {
                "class": "paragraph",
                "nested":
                    [
                       {
                          "class": "title",
                          "text": "Upgrade"
                        },
                       {
                          "class": "content",
                          "text": "As far as upgrade goes, this page is the perfect example. It's not exactly an upgrade as I developed it this way from the beginning. But! Here's the things I want to point out. If you visit this page without a JavaScript, you'll see an error message. That's about all the HTML code I got on this webpage. Normally, a webpage/site's interface is coded in HTML and CSS. But since I wanted to be able to change the contents at will (plus the multilanguage feature), I got a little creative. And I wanted that routing feature React.js got. It took me quite a while to learn it in Vanilla JS, so didn't want to waste it."
                        },
                       {
                          "class": "content",
                          "text": "Anyways, the point is, that's how I upgrade your website. I just put some classes in the HTML file (or just work with the ones we got), add my script and let it do its magic. It doesn't even have to do anything to its old features. Just adds new ones."
                        },
                       {
                          "class": "content",
                          "text": "Upgrading another kind of program would actually need more tweaks. Since I'd have to put in one or more functions in the old code (if I can import a code from another file) or open up/join a connection of some kind to reach the new program."
                        }
                     ]
              }
           ]
    }
 ]