[
   {
      "name": "landing",
      "nested":
          [
             {
                "class": "intro",
                "text": "Sincerly,"
              },
             {
                "class": "motto",
                "text": "Yours truly!"
              }
           ]
    },
   {
      "name": "briefing",
      "nested":
          [
             {
                "class": "paragraph",
                "nested":
                    [
                       {
                          "class": "title",
                          "text": "Who am I?"
                        },
                       {
                          "class": "content",
                          "text": "I am a coder. Through and through. I love codes and codes adore me. It's that kind of thing. I love to be in position where I can code the most. That is exactly why I chose API development/integration. You just tell me what feature you want for your app; web or not matters not. And I deliver it to you. Simple as that. For the web part, I can even embed it myself using a JavaScript code (as I'm also quite into JavaScript). All you'd need to tell me is how it should interact with your User Interface."
                        }
                     ]
              },
              {
                 "class": "paragraph",
                 "nested":
                    [
                       {
                          "class": "title",
                          "text": "What's an API"
                        },
                       {
                          "class": "content",
                          "text": "An Application Programming Interface (or API for short) is a program that performs a particular task to be used by another program that can't perfom said task for a reason or another. For example, JavaScprit can't interact with the file system. Best it can do is read a file through one of its embedded fetching APIs. Yes, JavaScript does have embedded APIs. In fact, it has quite a few (a lot) of them. But if you want to interact with the file system, you'd have to outsource it to a server API. Said server API could optionally run a program or just listen and reponds to the requests directly."
                        },
                       {
                          "class": "content",
                          "text": "So, in short, an API is a program where you can outsource some workloads from your main program. It has many advantages. Including but not limited to asynchronous programming, languages mixing."
                        }
                     ]
              },
             {
                "class": "paragraph",
                "nested":
                    [
                       {
                          "class": "title",
                          "text": "API Development & Integration"
                        },
                       {
                          "class": "content",
                          "text": "And this is where yours truly comes in handy. As stated before, I am an API developer. I code these little programs you can outsource tasks to. Because it's a completely different program, it can be coded in anything. All that matters is what can do the desired task better. So even if your program is in Java, the API can be coded in C, C#, Go, Swift or whatever. It won't affect the main program that much. The only restricting party could be the platform the API is hosted on. Apart from that, there isn't much."
                        },
                       {
                          "class": "content",
                          "text": "Also, the API can be hosted almost anywhere. Even on another device. The main program just has to have access to where it is. If the API is on another device, the main program has to have access to said device one way or another. Usually, in this case, the two programs (main and API) communicate through some sort of network, interfaced by a socket."
                        }
                     ]
              },
             {
                "class": "paragraph",
                "nested":
                    [
                       {
                          "class": "title",
                          "text": "UI/UX Design"
                        },
                       {
                          "class": "content",
                          "text": "As evidenced by this page, I'm not very good at UI designing. The only designing I have a smudge of confidence in is UX. My interfaces are almost always meant to make the program easy to use. Not make it pretty. And it's not really because I don't enjoy the nice views some apps have. But I guess I just don't have it. I don't have what it takes to make colorful designs. Be that as it may, if you give me a design, I can very well translate it into codes. The only part I'm struggling at is coming up with all those colors and how what should look like. Dark design is easy though. Easy enough that even I can do it. You don't really have to worry about what color should go with what. Just how dark or light something should be."
                        }
                     ]
              }
           ]
    }
 ]